Airfoil/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    airfoil
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
   
    rotorFrontAndBack
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    interface_stator
    {
        type            cyclicAMI;
        value           uniform $flowVelocity;
    }
    interface_rotor
    {
        type            cyclicAMI;
        value           uniform $flowVelocity;
    }
    
    TOP
    {
        type            symmetry;
    }
    BOTTOM
    {
        type            symmetry;
    }
    INLET
    {
        type            fixedValue;
        value           uniform $flowVelocity;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform $flowVelocity;
    }
}


// ************************************************************************* //
