Airfoil/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    airfoil
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    
    rotorFrontAndBack
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    interface_stator
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    interface_rotor
    {
        type            cyclicAMI;
        value           uniform 0;
    }
   
    TOP
    {
        type            symmetry;
    }
    BOTTOM
    {
        type            symmetry;
    }
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
