Airfoil/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
    
    rotorFrontAndBack
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    interface_stator
    {
        type            cyclicAMI;
        value           uniform $turbulentOmega;
    }
    interface_rotor
    {
        type            cyclicAMI;
        value           uniform $turbulentOmega;
    }
    
    TOP
    {
        type            symmetry;
    }
    BOTTOM
    {
        type            symmetry;
    }
    INLET
    {
        type            fixedValue;
        value           uniform $turbulentOmega;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform $turbulentOmega;
        value           uniform $turbulentOmega;
    }
}


// ************************************************************************* //
