Airfoil/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     backward;
}

gradSchemes
{
    default     Gauss linear;

    grad(k)     cellLimited Gauss linear 1;
    grad(omega) cellLimited Gauss linear 1;
}

divSchemes
{
    default         linear;

    div(phi,U)      Gauss linearUpwindV grad(U); 
    div(phi,k)      Gauss limitedLinear 1; 
    div(phi,omega)  Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default     no;
    pcorr;
    p;
}

wallDist
{
    method  meshWave;
}

// ************************************************************************* //
