Airfoil/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


forces
{
    type        forces;
    libs        (forces);

    executeControl    timeStep;
    executeInterval   5;

    writeControl      timeStep;
    writeInterval     5;

    log         yes;

    patches     (airfoil);

    rho         rhoInf; 
    rhoInf      1; 
    CofR        (0 0 0);
    pitchAxis   (0 0 1);
}


// ************************************************************************* //
