Airfoil/system/solverInfo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


solverInfo
{
	type        solverInfo;
	libs        ("libutilityFunctionObjects.so");
	fields      (U p k omega);
}

// ************************************************************************* //

